GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x722: file p1final.c, line 5.
(gdb) r
Starting program: /home/runner/cprogramming/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1final.c:5
5   int main(){
(gdb) n
7     printf("Enter First Number : ");
(gdb) n
8     scanf("%d", &a);
(gdb) n
Enter First Number : 1
9     printf("Enter Second Number : ");
(gdb) p a
$1 = 1
(gdb) n
10    scanf("%d", &b);
(gdb) n
Enter Second Number : 5
11    c = a + b;
(gdb) p b
$2 = 5
(gdb) p a+b
$3 = 6
(gdb) n
12    printf("The Sum of %d and %d is %d \n", a, b,c);
(gdb) n
The Sum of 1 and 5 is 6 
13    return 0;
(gdb) c
Continuing.
[Inferior 1 (process 1783) exited normally]